99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt.c
#include "esp32_mquickjs_wifi_twt.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
#include "esp32_mquickjs_wifi_twt_radio.h"
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_wifi_twt_information.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <stdatomic.h>

struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_twt_token_t token;
    esp32_mquickjs_wifi_twt_probe_radio_state_t result;
    uint32_t response_ms, timeout_ms;
    esp_err_t error;
    const char *stage;
    bool submitted;
    atomic_bool worker_done, cancel_requested;
};
/* One Future resource lane transfers only a token here. Radio keeps the marker
 * address and native owner; no Future/JS/runtime pointer enters this record. */
static portMUX_TYPE s_twt_retired_lock = portMUX_INITIALIZER_UNLOCKED;
static struct {
    esp32_mquickjs_wifi_twt_token_t token;
    int64_t next_retry_us;
    esp_err_t error;
    bool active, busy;
} s_twt_retired;
static const char s_twt_future_lane;

static bool twt_retired_pending(void)
{
    portENTER_CRITICAL(&s_twt_retired_lock);
    bool pending = s_twt_retired.active;
    portEXIT_CRITICAL(&s_twt_retired_lock);
    return pending;
}
static void twt_cleanup_worker(void *opaque)
{
    (void)opaque;
    portENTER_CRITICAL(&s_twt_retired_lock);
    esp32_mquickjs_wifi_twt_token_t token = s_twt_retired.token;
    portEXIT_CRITICAL(&s_twt_retired_lock);
    esp32_mquickjs_wifi_twt_token_t current = {0};
    esp_err_t error = ESP_OK;
    if (esp32_mquickjs_wifi_radio_twt_probe_cleanup_token(&current) &&
        current.identity == token.identity && current.generation == token.generation)
        error = esp32_mquickjs_wifi_radio_twt_probe_retire(&token);
    else token = (esp32_mquickjs_wifi_twt_token_t){0}; /* Already retired; never touch a successor. */
    int64_t next = esp_timer_get_time() + 100000;
    portENTER_CRITICAL(&s_twt_retired_lock);
    s_twt_retired.token = token;
    s_twt_retired.active = token.identity != 0U;
    s_twt_retired.error = error;
    s_twt_retired.next_retry_us = next;
    s_twt_retired.busy = false;
    portEXIT_CRITICAL(&s_twt_retired_lock);
}
bool esp32_mquickjs_wifi_twt_service(void)
{
    bool agreement_work = esp32_mquickjs_wifi_twt_agreement_service();
    esp32_mquickjs_wifi_twt_token_t pending = {0};
    if (esp32_mquickjs_wifi_radio_twt_probe_cleanup_token(&pending)) {
        portENTER_CRITICAL(&s_twt_retired_lock);
        if (!s_twt_retired.active && !s_twt_retired.busy) {
            s_twt_retired.token = pending;
            s_twt_retired.active = true;
            s_twt_retired.error = ESP_OK;
            s_twt_retired.next_retry_us = 0;
        }
        portEXIT_CRITICAL(&s_twt_retired_lock);
    }
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_twt_retired_lock);
    bool submit = s_twt_retired.active && !s_twt_retired.busy && now >= s_twt_retired.next_retry_us;
    if (submit) s_twt_retired.busy = true;
    portEXIT_CRITICAL(&s_twt_retired_lock);
    if (!submit) return agreement_work;
    if (esp32_mquickjs_submit_background_worker(twt_cleanup_worker, NULL)) return true;
    portENTER_CRITICAL(&s_twt_retired_lock);
    s_twt_retired.busy = false;
    s_twt_retired.next_retry_us = now + 100000;
    portEXIT_CRITICAL(&s_twt_retired_lock);
    return agreement_work;
}
bool esp32_mquickjs_prepare_wifi_twt_runtime_destroy(void)
{
    bool agreements_closed = esp32_mquickjs_prepare_wifi_twt_agreement_runtime_destroy();
    (void)esp32_mquickjs_wifi_twt_service();
    return agreements_closed && !twt_retired_pending();
}
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)
static JSValue twt_control_error(JSContext *ctx, const char *operation,
    const esp32_mquickjs_wifi_radio_config_result_t *state)
{
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details)) goto fail;
    SET(details, "espCode", JS_NewInt32(ctx, state->error));
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(state->error)));
    SET(details, "stage", state->stage ? JS_NewString(ctx, state->stage) : JS_NULL);
    SET(details, "mutationAttempted", JS_NewBool(state->mutation_attempted));
    JSValue result = esp32_mquickjs_throw_native_error(ctx, "WIFI_TWT_CONTROL_FAILED", operation,
        "TWT control failed; inspect the native error and Radio state", *details);
    JS_PopGCRef(ctx, &ref);
    return result;
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static bool twt_policy_capture(JSContext *ctx, JSValue input, wifi_twt_config_t *config)
{
    static const char *const keys[] = {"postWakeupEvents", "keepAlive"};
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *value = JS_PushGCRef(ctx, &value_ref);
    *options = input;
    *config = (wifi_twt_config_t){0};
    bool valid = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.twt.configure", keys, 2)) goto done;
    for (unsigned i = 0; i < 2; ++i) {
        *value = JS_GetPropertyStr(ctx, *options, keys[i]);
        if (JS_IsException(*value)) goto done;
        if (!JS_IsBool(*value)) { JS_ThrowTypeError(ctx, "TWT policy requires postWakeupEvents and keepAlive booleans"); goto done; }
        if (i == 0) config->post_wakeup_event = *value == JS_TRUE;
        else config->twt_enable_keep_alive = *value == JS_TRUE;
    }
    valid = true;
done:
    JS_PopGCRef(ctx, &value_ref); JS_PopGCRef(ctx, &options_ref);
    return valid;
}

static JSValue twt_policy_value(JSContext *ctx, const wifi_twt_config_t *config)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "postWakeupEvents", JS_NewBool(config->post_wakeup_event));
    SET(result, "keepAlive", JS_NewBool(config->twt_enable_keep_alive));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

